tutorials/incompressible/MRFSimpleFoam/axialTurbine_mixingPlane/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 -1 );

boundaryField
{
    GVINLET
    {
        type            fixedValue;
        value           uniform ( 0 0 -1 );
    }
    GVOUTLET
    {
        type            mixingPlane;
    }
    GVCYCLIC
    {
        type            cyclic;
    }
    GVBLADE
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    GVHUB
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    GVSHROUD
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    RUINLET
    {
        type            mixingPlane;
    }
    RUOUTLET
    {
        type            mixingPlane;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
    }
    RUBLADE
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    RUHUB
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    RUSHROUD
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    DTINLET
    {
        type            mixingPlane;
    }
    DTOUTLET
    {
        type            zeroGradient;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
    }
    DTHUB
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    DTSHROUD
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
